app/Http/Controllers/Auth/RegisteredUserController.php

insert into `tanents` (`name`, `updated_at`, `created_at`) values ('Dolorem aute quos ut', '2025-03-11 07:48:10', '2025-03-11 07:48:10')
select * from `tanents` where (`name` = 'Dolorem aute quos ut') limit 1
insert into `users` (`name`, `tanent_id`, `email`, `password`, `updated_at`, `created_at`) values ('Leilani Burton', 10002, 'zojatyfi@mailinator.com', '$2y$12$w9sAjkguWPh1bSK2AxPOa.LiChtnVCwUaB3am6QTQx4Vxm.oxhGSm', '2025-03-11 07:48:10', '2025-03-11 07:48:10')
---
    public function store(Request $request): RedirectResponse
    {
        // dd($request->all());
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'tanent_id' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:' . User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $tanent = Tanent::firstOrCreate([
            'name' => $request->tanent_id,
        ]);

        $user = User::create([
            'name' => $request->name,
            'tanent_id' => $tanent->id,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);