routes/web.php

select * from `tanents` where `tanents`.`id` in (3)
select * from `users` where `tanent_id` = 3
select * from `tanents` where `tanents`.`id` in (1)
select * from `users` where `tanent_id` = 1
---
    return view('welcome');
});

Route::get('/dashboard', function () {
    //$users = User::all();
    // $users = User::with('tanent')->where("tanent_id", Auth::user()->tanent_id)->get();
    //$users = User::where("tanent_id", Auth::user()->tanent->id)->get();
    //that N+1 problem
    $users = User::teams()->get();

    //solve n+1 problem
    $users = User::with('tanent')->teams()->get();

    Route::resource('articals', ArticalController::class);

    return view('dashboard', get_defined_vars());
})->middleware(['auth', 'verified'])->name('dashboard');