app/Http/Controllers/ArticalController.php

    public function index()
    {
        $articals = Artical::teams()->get();
---
select * from `articals`